# Reset all constraints
reset_design

#---------------- SET AREA CONSTRAINT ----------------
# 1

#---------------- SET TIMING CONSTRAINTS ----------------
# 2.1 Set clock
create_clock -period 12.2 [get_ports clk]
set_clock_uncertainty 0.5 [get_clocks clk]     
set_clock_transition 0.2 [get_clocks clk]

######################## YBR ######################
set_clock_latency -source 4 [get_clocks clk]
set_clock_latency 0.3 [get_clocks clk]
######################## YBR ######################

# 2.2
set_input_delay -max 6.1 -clock clk [remove_from_collection [all_inputs] [get_ports clk]]
# 2.3
set_output_delay -max 6.1 -clock clk [all_outputs]

#---------------- SET ENVIRONMENTAL ATTIBUTES ----------------
# 3.1 Set interconnect parasitic RCs
# Set wire Load Model
set_wire_load_mode segmented
set_wire_load_model -name smic18_wl10  # add this line
set auto_wire_load_selection true
# Or use topographic mode

# 3.2 Set input drivers and transition times
#set_driving_cell -lib_cell PO8W -pin PAD [remove_from_collection [all_inputs] [get_ports clk]]
set_driving_cell -lib_cell PO8W -pin PAD [all_inputs]
#set_drive 0 clk

# 3.3 Set output capacitive loads
set_load [load_of SP018W_V1p5_max/PIW/PAD] [all_outputs]

# 3.4 Set PVT operating conditions or ‘corners’
#set target_library


#---------------- SET DESIGN RULE CONSTRAINTS ----------------
#4 
# Limit the input load
#set all_in_ex_clk [remove_from_collection [all_inputs] [get_ports Clk]]
#set MAX_INPUT_LOAD [expr [load_of ssc_core_slow/and2a1/A] * 10]
#set_max_capacitance $MAX_INPUT_LOAD $all_in_ex_clk

# Specifies a maximum transition on ports or designs
set_max_transition 3.0 [current_design]

# Sets maximum fanout for input ports or designs
#set_max_fanout  32 [current_design]

#---------------- OTHER ----------------
# 5
# Reset network
set_ideal_network {rstn}
set_dont_touch [get_cells "PIW* PO8W*"] true
set_fix_multiple_port_nets -all -buffer_constants
