###################################################################

# Created by write_sdc on Tue Dec  1 18:15:19 2015

###################################################################
set sdc_version 1.8

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_mode segmented
set_max_fanout 32 [current_design]
set_max_transition 3 [current_design]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports rstn]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports {mode[1]}]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports {mode[0]}]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports start]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports {din[15]}]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports {din[14]}]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports {din[13]}]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports {din[12]}]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports {din[11]}]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports {din[10]}]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports {din[9]}]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports {din[8]}]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports {din[7]}]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports {din[6]}]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports {din[5]}]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports {din[4]}]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports {din[3]}]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports {din[2]}]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports {din[1]}]
set_driving_cell -lib_cell PO2W -pin PAD [get_ports {din[0]}]
set_load -pin_load 4.37 [get_ports {dout[15]}]
set_load -pin_load 4.37 [get_ports {dout[14]}]
set_load -pin_load 4.37 [get_ports {dout[13]}]
set_load -pin_load 4.37 [get_ports {dout[12]}]
set_load -pin_load 4.37 [get_ports {dout[11]}]
set_load -pin_load 4.37 [get_ports {dout[10]}]
set_load -pin_load 4.37 [get_ports {dout[9]}]
set_load -pin_load 4.37 [get_ports {dout[8]}]
set_load -pin_load 4.37 [get_ports {dout[7]}]
set_load -pin_load 4.37 [get_ports {dout[6]}]
set_load -pin_load 4.37 [get_ports {dout[5]}]
set_load -pin_load 4.37 [get_ports {dout[4]}]
set_load -pin_load 4.37 [get_ports {dout[3]}]
set_load -pin_load 4.37 [get_ports {dout[2]}]
set_load -pin_load 4.37 [get_ports {dout[1]}]
set_load -pin_load 4.37 [get_ports {dout[0]}]
set_load -pin_load 4.37 [get_ports {dout_mode[1]}]
set_load -pin_load 4.37 [get_ports {dout_mode[0]}]
set_ideal_network [get_ports rstn]
create_clock [get_ports clk]  -period 20  -waveform {0 10}
set_clock_uncertainty 0.2  [get_clocks clk]
set_clock_transition -fall 0.1 [get_clocks clk]
set_clock_transition -rise 0.1 [get_clocks clk]
set_input_delay -clock clk  -max 0.5  [get_ports rstn]
set_input_delay -clock clk  -max 0.5  [get_ports {mode[1]}]
set_input_delay -clock clk  -max 0.5  [get_ports {mode[0]}]
set_input_delay -clock clk  -max 0.5  [get_ports start]
set_input_delay -clock clk  -max 0.5  [get_ports {din[15]}]
set_input_delay -clock clk  -max 0.5  [get_ports {din[14]}]
set_input_delay -clock clk  -max 0.5  [get_ports {din[13]}]
set_input_delay -clock clk  -max 0.5  [get_ports {din[12]}]
set_input_delay -clock clk  -max 0.5  [get_ports {din[11]}]
set_input_delay -clock clk  -max 0.5  [get_ports {din[10]}]
set_input_delay -clock clk  -max 0.5  [get_ports {din[9]}]
set_input_delay -clock clk  -max 0.5  [get_ports {din[8]}]
set_input_delay -clock clk  -max 0.5  [get_ports {din[7]}]
set_input_delay -clock clk  -max 0.5  [get_ports {din[6]}]
set_input_delay -clock clk  -max 0.5  [get_ports {din[5]}]
set_input_delay -clock clk  -max 0.5  [get_ports {din[4]}]
set_input_delay -clock clk  -max 0.5  [get_ports {din[3]}]
set_input_delay -clock clk  -max 0.5  [get_ports {din[2]}]
set_input_delay -clock clk  -max 0.5  [get_ports {din[1]}]
set_input_delay -clock clk  -max 0.5  [get_ports {din[0]}]
set_output_delay -clock clk  -max 0.5  [get_ports {dout[15]}]
set_output_delay -clock clk  -max 0.5  [get_ports {dout[14]}]
set_output_delay -clock clk  -max 0.5  [get_ports {dout[13]}]
set_output_delay -clock clk  -max 0.5  [get_ports {dout[12]}]
set_output_delay -clock clk  -max 0.5  [get_ports {dout[11]}]
set_output_delay -clock clk  -max 0.5  [get_ports {dout[10]}]
set_output_delay -clock clk  -max 0.5  [get_ports {dout[9]}]
set_output_delay -clock clk  -max 0.5  [get_ports {dout[8]}]
set_output_delay -clock clk  -max 0.5  [get_ports {dout[7]}]
set_output_delay -clock clk  -max 0.5  [get_ports {dout[6]}]
set_output_delay -clock clk  -max 0.5  [get_ports {dout[5]}]
set_output_delay -clock clk  -max 0.5  [get_ports {dout[4]}]
set_output_delay -clock clk  -max 0.5  [get_ports {dout[3]}]
set_output_delay -clock clk  -max 0.5  [get_ports {dout[2]}]
set_output_delay -clock clk  -max 0.5  [get_ports {dout[1]}]
set_output_delay -clock clk  -max 0.5  [get_ports {dout[0]}]
set_output_delay -clock clk  -max 0.5  [get_ports {dout_mode[1]}]
set_output_delay -clock clk  -max 0.5  [get_ports {dout_mode[0]}]
